billing_cf/InformationRegisters/энргИдентификаторыАбонентаГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргИдентификаторыАбонентаГИСЖКХ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЖКУГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДоговораГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДомаФИАС</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УникальныйНомерДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УникальныйНомерПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/InformationRegisters/бестВыгруженныеУслугиДоговоровГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестВыгруженныеУслугиДоговоровГИСЖКХ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестВидыУслугЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоммунальныйРесурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКоммунальныеРесурсыЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтатусыРаботыСГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/InformationRegisters/бестИсторияОплатыГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестИсторияОплатыГИСЖКХ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтатусыРаботыСГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/Enums/бестСтатусыРаботыСГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестСтатусыРаботыСГИСЖКХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгруженоВГИСЖКХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженоВГИСЖКХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПриЗагрузкеВГИСЖХК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоваяЗапись</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

billing_cf/Enums/энргСостояниеПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

billing_cf/CommonModules/бестОбменСГИС/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытий

Процедура бестЗарегистрироватьКОбменуСГИСПриПроведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
 	Если Не энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестВключитьОбменСГИС") Тогда	
 
		Возврат;
	КонецЕсли;
	
	ЭтоОткрытиеЛС					= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОперацияСЛицевымСчетом") И Источник.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС;
	ЭтоЗакрытиеЛС					= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОперацияСЛицевымСчетом") И Источник.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС;
	ЭтоПодключениеУслуги			= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОперацияСУслугами") И Источник.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги;
	ЭтоОтключениеУслуги				= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОперацияСУслугами") И Источник.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги;
	ЭтоРегистрацияПоказанийМКД		= (ТипЗнч(Источник) = Тип("ДокументОбъект.энргРегистрацияПоказанийМКД"));// или ТипЗнч(Источник) = Тип("ДокументОбъект.энргОбходнойЛистМКД"));
 	ЭтоРегистрацияПоказанийАбонента	= (ТипЗнч(Источник) = Тип("ДокументОбъект.энргРегистрацияПоказанийАбонента"));// или ТипЗнч(Источник) = Тип("ДокументОбъект.энргОбходнойЛист"));//((ТипЗнч(Источник) = Тип("ДокументОбъект.энргРегистрацияПоказанийАбонента"))  
 	ЭтоОбходнойЛист					= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОбходнойЛист");
	ЭтоКвитанция					= ТипЗнч(Источник) = Тип("ДокументОбъект.энргПриходныйКассовыйОрдер");
	ЭтоОткрытиеМКД					= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОткрытиеМКД") И Источник.ВидОперации = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие;
	ЭтоЗакрытиеМКД					= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОткрытиеМКД") И Источник.ВидОперации = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Закрытие;
	ЭтоВводПУ						= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОперацияСПриборомУчета") И Источник.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ;
	ЭтоВыводПУ						= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОперацияСПриборомУчета") И Источник.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ;
	ЭтоЗаменаПУ						= ТипЗнч(Источник) = Тип("ДокументОбъект.энргОперацияСПриборомУчета") И Источник.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ;
	ЭтоВводНачальныхОстатков		= ТипЗнч(Источник) = Тип("ДокументОбъект.энргВводНачальныхОстатков");
	ЭтоОплата						= ТипЗнч(Источник) = Тип("ДокументОбъект.энргПлатежноеПоручениеВходящие");
	
	СтруктураИсточника = Новый Структура;
	СтруктураИсточника.Вставить("ЭтоОткрытиеЛС",							ЭтоОткрытиеЛС);
	СтруктураИсточника.Вставить("ЭтоЗакрытиеЛС",							ЭтоЗакрытиеЛС);
	СтруктураИсточника.Вставить("ЭтоПодключениеУслуги",						ЭтоПодключениеУслуги);
	СтруктураИсточника.Вставить("ЭтоОтключениеУслуги",						ЭтоОтключениеУслуги);
	СтруктураИсточника.Вставить("ЭтоРегистрацияПоказанийМКД",				ЭтоРегистрацияПоказанийМКД);
	СтруктураИсточника.Вставить("ЭтоРегистрацияПоказанийАбонента",			ЭтоРегистрацияПоказанийАбонента);
 	СтруктураИсточника.Вставить("ЭтоКвитанция",								ЭтоКвитанция);
	СтруктураИсточника.Вставить("ЭтоОткрытиеМКД",							ЭтоОткрытиеМКД);
	СтруктураИсточника.Вставить("ЭтоЗакрытиеМКД",							ЭтоЗакрытиеМКД);
	СтруктураИсточника.Вставить("ЭтоВводПУ",								ЭтоВводПУ);
	СтруктураИсточника.Вставить("ЭтоВыводПУ",								ЭтоВыводПУ);
	СтруктураИсточника.Вставить("ЭтоЗаменаПУ",								ЭтоЗаменаПУ);
	СтруктураИсточника.Вставить("ЭтоВводНачальныхОстатков",					ЭтоВводНачальныхОстатков);
	СтруктураИсточника.Вставить("ЭтоОплата",								ЭтоОплата);
	СтруктураИсточника.Вставить("ЭтоОбходнойЛист",								ЭтоОбходнойЛист);
	
	Если ЭтоВводНачальныхОстатков Тогда
		Для Каждого ТекАбонент Из Источник.Абоненты Цикл
			ВыполнитьРегистрацию(СтруктураИсточника, Источник, ТекАбонент.Абонент);	
		КонецЦикла;
	ИначеЕсли ЭтоОткрытиеМКД Или ЭтоЗакрытиеМКД Тогда
		ВыполнитьРегистрацию(СтруктураИсточника, Источник, Неопределено);
	ИначеЕсли ЭтоРегистрацияПоказанийМКД Тогда
		ВыполнитьРегистрацию(СтруктураИсточника, Источник, Неопределено);
 	ИначеЕсли ЭтоОбходнойЛист Тогда
 
		ВыполнитьРегистрацию(СтруктураИсточника, Источник, Неопределено);
	ИначеЕсли ЭтоОплата Тогда
		ВыполнитьРегистрацию(СтруктураИсточника, Источник, Неопределено);	
	Иначе
		ВыполнитьРегистрацию(СтруктураИсточника, Источник, Источник.Абонент);
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Процедура  ВыполнитьРегистрацию(СтруктураИсточника, Источник, Абонент)
	#Область ОбщиеПараметры	
	Если Не СтруктураИсточника.ЭтоОплата Тогда	
		МКД					= Справочники.энргСтроения.ПустаяСсылка();
		Если Источник.ДополнительныеСвойства.Свойство("ДанныеСтроения") Тогда
 			Если Не Источник.ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор Тогда
 				МКД		= Источник.ДополнительныеСвойства.ДанныеСтроения.Строение; 
			КонецЕсли;		
		КонецЕсли;
		
		ПараметрыОтбора		= Новый Структура;
		Если СтруктураИсточника.ЭтоРегистрацияПоказанийМКД Или СтруктураИсточника.ЭтоОткрытиеМКД Или СтруктураИсточника.ЭтоЗакрытиеМКД Тогда
			ПараметрыОтбора.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.АдресДома);
			НайденныеСтроки = МКД.КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
		Иначе
 			Если Источник.ДополнительныеСвойства.Свойство("ДанныеСтроения") Тогда
				Если Источник.ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор Тогда
 
					ПараметрыОтбора.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.АдресПомещения);
					НайденныеСтроки		= Источник.ДополнительныеСвойства.ДанныеСтроения.Помещение.КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора); 
				Иначе
					ПараметрыОтбора.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.АдресДома);
					НайденныеСтроки		= Источник.ДополнительныеСвойства.ДанныеСтроения.Строение.КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
				КонецЕсли;
			Иначе
				ПараметрыОтбора.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.АдресОбъекта);
				НайденныеСтроки = Абонент.КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
		Если (СтруктураИсточника.ЭтоОткрытиеЛС Или СтруктураИсточника.ЭтоВводНачальныхОстатков) И ЗначениеЗаполнено(МКД) Тогда
			ПараметрыОтбора.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.АдресДома);
			НайденныеСтрокиМКД = МКД.КонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
			АдресМКД		= ?(НайденныеСтрокиМКД.Количество() > 0, НайденныеСтрокиМКД[0].Представление, "");
		Иначе
			АдресМКД		= "";
		КонецЕсли;
		
		АдресОЖФ		= ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Представление, "");
		Значение		= ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Значение, "");
		ЗначенияПолей	= ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].ЗначенияПолей, "");
		Период			= Источник.Дата;
		
		Если Значение = "" И СтрНачинаетсяС(СокрЛ(ЗначенияПолей), "{") Тогда 
			Значение = ЗначенияПолей;
		КонецЕсли;
		
		НомерПомещения = "";
		Если СтрНачинаетсяС(СокрЛ(Значение), "{") Тогда 
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Значение);
			КонтактнаяИнформация = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Если КонтактнаяИнформация.Свойство("Apartments") И КонтактнаяИнформация.Apartments <> Неопределено
				И КонтактнаяИнформация.Apartments.Количество() > 0 Тогда
				
				НомерПомещения = КонтактнаяИнформация.Apartments[0].Number; 
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос;
 		Запрос.Текст = 
  		"ВЫБРАТЬ
		|	энргИдентификаторыАбонентаГИСЖКХ.ИдентификаторЖКУГИСЖКХ КАК ИдентификаторЖКУГИСЖКХ,
		|	энргИдентификаторыАбонентаГИСЖКХ.ИдентификаторДоговораГИСЖКХ КАК ИдентификаторДоговораГИСЖКХ,
		|	энргИдентификаторыМКДГИСЖКХ.ИдентификаторДомаФИАС КАК ИдентификаторДомаФИАС,
		|	ВЫБОР
		|		КОГДА &МКД = ЗНАЧЕНИЕ(справочник.энргСтроения.пустаяссылка)
 
		|			ТОГДА энргИдентификаторыАбонентаГИСЖКХ.ОКТМО
		|		ИНАЧЕ энргИдентификаторыМКДГИСЖКХ.ОКТМО
		|	КОНЕЦ КАК ОКТМО,
		|	ВЫБОР
		|		КОГДА &МКД = ЗНАЧЕНИЕ(справочник.энргСтроения.пустаяссылка)
 		|			ТОГДА ""ЖД""
		|		КОГДА энргСтроения.ТипСтроения = ЗНАЧЕНИЕ(Перечисление.энргТипыСтроений.МКД)
 		|			ТОГДА ""МКД""
		|		КОГДА энргСтроения.ТипСтроения = ЗНАЧЕНИЕ(Перечисление.энргТипыСтроений.ЖД)
		|			ТОГДА ""ЖД""
		|		КОГДА энргСтроения.ТипСтроения = ЗНАЧЕНИЕ(Перечисление.энргТипыСтроений.ЖД_БлокЗастройки)
		|			ТОГДА ""ЖД блок. застройки""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипДома,
		|	ВЫБОР
		|		КОГДА энргТипСхемыГВССрезПоследних.ТипСхемы ЕСТЬ NULL
		|				ИЛИ энргТипСхемыГВССрезПоследних.ТипСхемы = ЗНАЧЕНИЕ(Перечисление.энргТипыСхемТеплоснабжения.ОткрытаяСхема)
		|			ТОГДА ""Открытая""
		|		ИНАЧЕ ""Закрытая""
		|	КОНЕЦ КАК ТипСхемы,
		|	ВЫБОР
		|		КОГДА &МКД = ЗНАЧЕНИЕ(справочник.энргСтроения.пустаяссылка)
		|			ТОГДА энргИдентификаторыАбонентаГИСЖКХ.УникальныйНомерДома
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК УникальныйНомерДома,
		|	ВЫБОР
		|		КОГДА &МКД = ЗНАЧЕНИЕ(справочник.энргСтроения.пустаяссылка)
		|			ТОГДА """"
		|		ИНАЧЕ энргИдентификаторыАбонентаГИСЖКХ.УникальныйНомерПомещения
		|	КОНЕЦ КАК УникальныйНомерПомещения
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргИдентификаторыАбонентаГИСЖКХ КАК энргИдентификаторыАбонентаГИСЖКХ
		|		ПО энргАбоненты.Ссылка = энргИдентификаторыАбонентаГИСЖКХ.Абонент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргИдентификаторыМКДГИСЖКХ КАК энргИдентификаторыМКДГИСЖКХ
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргТипСхемыГВС.СрезПоследних(
		|					&Дата,
		|					Район = &РАйон
		|						И Организация = &Организация
		|						И МКД = &МКД) КАК энргТипСхемыГВССрезПоследних
		|			ПО энргИдентификаторыМКДГИСЖКХ.МКД = энргТипСхемыГВССрезПоследних.МКД
		|		ПО энргАбоненты.КлючПомещения.Строение = энргИдентификаторыМКДГИСЖКХ.МКД
		|ГДЕ
		|	энргАбоненты.Ссылка = &Абонент";
		
		Запрос.УстановитьПараметр("Абонент",		Абонент);
		Запрос.УстановитьПараметр("МКД",			МКД);
		Запрос.УстановитьПараметр("Район",			Источник.Район);
		Запрос.УстановитьПараметр("Организация",	Источник.Организация);
		Запрос.УстановитьПараметр("Дата",			Источник.Дата);
		Запрос.УстановитьПараметр("Ссылка",			Источник.Ссылка);
		
		ВыборкаИдентификаторов = Запрос.Выполнить().Выбрать();
		ВыборкаИдентификаторов.Следующий();
		
		#КонецОбласти
		
		#Область ВыгрузкаДоговоров
		Если СтруктураИсточника.ЭтоОткрытиеЛС Или СтруктураИсточника.ЭтоЗакрытиеЛС Или СтруктураИсточника.ЭтоПодключениеУслуги
			Или СтруктураИсточника.ЭтоОтключениеУслуги Или СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестВыгруженныеДоговорыГИСЖКХ.Период КАК Период
			|ИЗ
			|	РегистрСведений.бестВыгруженныеДоговорыГИСЖКХ КАК бестВыгруженныеДоговорыГИСЖКХ
			|ГДЕ
			|	бестВыгруженныеДоговорыГИСЖКХ.Абонент = &Абонент
			|	И бестВыгруженныеДоговорыГИСЖКХ.Статус = ЗНАЧЕНИЕ(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)
			|	И бестВыгруженныеДоговорыГИСЖКХ.Организация = &Организация
			|	И бестВыгруженныеДоговорыГИСЖКХ.Район = &Район";
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Если РезультатЗапроса.Следующий() Тогда
				// очищаем все старые записи этого Договора
				Набор = РегистрыСведений.бестВыгруженныеДоговорыГИСЖКХ.СоздатьНаборЗаписей();  			
				Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
				Набор.Отбор.Организация.Установить(Источник.Организация);
				Набор.Отбор.Район.Установить(Источник.Район);
				Набор.Отбор.Абонент.Установить(Абонент);
				//	Набор.Очистить();
				Набор.Записать();
			КонецЕсли;
			
			НоваяЗапись = РегистрыСведений.бестВыгруженныеДоговорыГИСЖКХ.СоздатьМенеджерЗаписи();  			
			НоваяЗапись.Период		= Период;
			НоваяЗапись.Организация	= Источник.Организация;
			НоваяЗапись.Район		= Источник.Район;
			НоваяЗапись.Абонент		= Абонент;
			
			НоваяЗапись.ДатаЗаключения				= Источник.Дата;
			НоваяЗапись.ФИАС						= ВыборкаИдентификаторов.ИдентификаторДомаФИАС;
			НоваяЗапись.ИдентификаторДоговораГИСЖКХ	= ВыборкаИдентификаторов.ИдентификаторДоговораГИСЖКХ;
			НоваяЗапись.ТипДома						= ВыборкаИдентификаторов.ТипДома;
			НоваяЗапись.НомерПомещения				= НомерПомещения;
			НоваяЗапись.АдресОЖФ					= АдресОЖФ;		
			НоваяЗапись.ТипСхемы					= ВыборкаИдентификаторов.ТипСхемы;
			НоваяЗапись.Статус						= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;
			НоваяЗапись.Записать();
			
			// выгрузка услуг по договорам
			Если СтруктураИсточника.ЭтоОткрытиеЛС Или СтруктураИсточника.ЭтоЗакрытиеЛС Тогда
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	бестВыгруженныеУслугиДоговоровГИСЖКХ.Период КАК Период
				|ИЗ
				|	РегистрСведений.бестВыгруженныеУслугиДоговоровГИСЖКХ КАК бестВыгруженныеУслугиДоговоровГИСЖКХ
				|ГДЕ
				|	бестВыгруженныеУслугиДоговоровГИСЖКХ.Абонент = &Абонент
				|	И бестВыгруженныеУслугиДоговоровГИСЖКХ.Статус = ЗНАЧЕНИЕ(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)
				|	И бестВыгруженныеУслугиДоговоровГИСЖКХ.Организация = &Организация
				|	И бестВыгруженныеУслугиДоговоровГИСЖКХ.Район = &Район";
				
				РезультатЗапроса = Запрос.Выполнить().Выбрать();
				Если РезультатЗапроса.Следующий() Тогда
					// очищаем все старые записи этого МКД
					Набор = РегистрыСведений.бестВыгруженныеУслугиДоговоровГИСЖКХ.СоздатьНаборЗаписей();  			
					Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
					Набор.Отбор.Организация.Установить(Источник.Организация);
					Набор.Отбор.Район.Установить(Источник.Район);
					Набор.Отбор.Абонент.Установить(Абонент);
					Набор.Записать();
				КонецЕсли;
			КонецЕсли;
			
			ТекстЗапроса = "";
			Если СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|	энргВводНачальныхОстатковАбоненты.IDСтроки КАК IDСтроки
				|ПОМЕСТИТЬ ВТ_IDСтроки
				|ИЗ
				|	Документ.энргВводНачальныхОстатков.Абоненты КАК энргВводНачальныхОстатковАбоненты
				|ГДЕ
				|	энргВводНачальныхОстатковАбоненты.Абонент = &Абонент
				|	И энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка;";
			КонецЕсли;
			Запрос.Текст = ТекстЗапроса + " " +  
			"ВЫБРАТЬ
			|	ТаблицаТочкиУчета.Услуга КАК Услуга,
			|	ТаблицаТочкиУчета.Услуга.бестВидУслугиЖКХ КАК ВидУслугиЖКХ,
			|	ТаблицаТочкиУчета.Услуга.бестКоммунальныйРесурсЖКХ КАК КоммунальныйРесурсЖКХ
			|ПОМЕСТИТЬ ВТ_Услуги
			|ИЗ
			|	Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТаблицаТочкиУчета
			|ГДЕ
			|	ТаблицаТочкиУчета.Ссылка = &Ссылка
			|	И НЕ ТаблицаТочкиУчета.Услуга.СоставнаяУслуга
			|	И ТаблицаТочкиУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	энргВидыУслугСоставляющиеУслуг.Услуга,
			|	энргВидыУслугСоставляющиеУслуг.Услуга.бестВидУслугиЖКХ,
			|	энргВидыУслугСоставляющиеУслуг.Услуга.бестКоммунальныйРесурсЖКХ
			|ИЗ
			|	Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТаблицаТочкиУчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
			|		ПО ТаблицаТочкиУчета.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
			|ГДЕ
			|	ТаблицаТочкиУчета.Ссылка = &Ссылка
			|	И ТаблицаТочкиУчета.Услуга.СоставнаяУслуга
			|	И ТаблицаТочкиУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ВТ_Услуги.Услуга, бестВыгруженныеУслугиДоговоровГИСЖКХСрезПоследних.Услуга) КАК Услуга,
			|	ЕСТЬNULL(ВТ_Услуги.ВидУслугиЖКХ, бестВыгруженныеУслугиДоговоровГИСЖКХСрезПоследних.Услуга.бестВидУслугиЖКХ) КАК ВидУслугиЖКХ,
			|	ЕСТЬNULL(ВТ_Услуги.КоммунальныйРесурсЖКХ, бестВыгруженныеУслугиДоговоровГИСЖКХСрезПоследних.Услуга.бестКоммунальныйРесурсЖКХ) КАК КоммунальныйРесурсЖКХ,
			|	МАКСИМУМ(бестВыгруженныеУслугиДоговоровГИСЖКХСрезПоследних.ДатаНачалаПоставки) КАК ДатаНачалаПоставки
			|ИЗ
			|	ВТ_Услуги КАК ВТ_Услуги
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестВыгруженныеУслугиДоговоровГИСЖКХ.СрезПоследних(
			|				&Дата,
			|				Организация = &Организация
			|					И Район = &Район
			|					И Абонент = &Абонент
			|					И ДатаНачалаПоставки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					И ДатаОкончанияПоставки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК бестВыгруженныеУслугиДоговоровГИСЖКХСрезПоследних
			|		ПО ВТ_Услуги.Услуга = бестВыгруженныеУслугиДоговоровГИСЖКХСрезПоследних.Услуга
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(ВТ_Услуги.ВидУслугиЖКХ, бестВыгруженныеУслугиДоговоровГИСЖКХСрезПоследних.Услуга.бестВидУслугиЖКХ),
			|	ЕСТЬNULL(ВТ_Услуги.КоммунальныйРесурсЖКХ, бестВыгруженныеУслугиДоговоровГИСЖКХСрезПоследних.Услуга.бестКоммунальныйРесурсЖКХ),
			|	ЕСТЬNULL(ВТ_Услуги.Услуга, бестВыгруженныеУслугиДоговоровГИСЖКХСрезПоследних.Услуга)";
			Если СтруктураИсточника.ЭтоПодключениеУслуги Или СтруктураИсточника.ЭтоОтключениеУслуги Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргОперацияСЛицевымСчетом", "энргОперацияСУслугами");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаТочкиУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоОткрытиеЛС Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаТочкиУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");	
			ИначеЕсли СтруктураИсточника.ЭтоЗакрытиеЛС Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЛЕВОЕ", "ПОЛНОЕ");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаТочкиУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргОперацияСЛицевымСчетом", "энргВводНачальныхОстатков");
			КонецЕсли;
			
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяЗапись = РегистрыСведений.бестВыгруженныеУслугиДоговоровГИСЖКХ.СоздатьМенеджерЗаписи();  			
				НоваяЗапись.Период		= Период;
				НоваяЗапись.Организация	= Источник.Организация;
				НоваяЗапись.Район		= Источник.Район;
				НоваяЗапись.Абонент		= Абонент;
				НоваяЗапись.Услуга		= Выборка.Услуга;
				
				НоваяЗапись.УслугаЖКХ				= Выборка.ВидУслугиЖКХ;
				НоваяЗапись.КоммунальныйРесурс		= Выборка.КоммунальныйРесурсЖКХ;
				НоваяЗапись.ДатаНачалаПоставки		= ?(ЗначениеЗаполнено(Выборка.ДатаНачалаПоставки),Выборка.ДатаНачалаПоставки,Источник.Дата);
				Если СтруктураИсточника.ЭтоОтключениеУслуги Или СтруктураИсточника.ЭтоЗакрытиеЛС Тогда
					НоваяЗапись.ДатаОкончанияПоставки	= Источник.Дата;
				КонецЕсли;
				НоваяЗапись.Статус					= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;
				
				НоваяЗапись.Записать();
			КонецЦикла;
		КонецЕсли;
		#КонецОбласти
		
		#Область ВыгрузкаЛС
		Если СтруктураИсточника.ЭтоОткрытиеЛС Или СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестВыгруженныеЛСГИСЖКХ.Период КАК Период
			|ИЗ
			|	РегистрСведений.бестВыгруженныеЛСГИСЖКХ КАК бестВыгруженныеЛСГИСЖКХ
			|ГДЕ
			|	бестВыгруженныеЛСГИСЖКХ.Абонент = &Абонент
			|	И бестВыгруженныеЛСГИСЖКХ.Статус = ЗНАЧЕНИЕ(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)
			|	И бестВыгруженныеЛСГИСЖКХ.Организация = &Организация
			|	И бестВыгруженныеЛСГИСЖКХ.Район = &Район";
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Пока РезультатЗапроса.Следующий() Цикл
				// очищаем все старые записи этого ЛС
				Набор = РегистрыСведений.бестВыгруженныеЛСГИСЖКХ.СоздатьНаборЗаписей();  			
				Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
				Набор.Отбор.Организация.Установить(Источник.Организация);
				Набор.Отбор.Район.Установить(Источник.Район);
				Набор.Отбор.Абонент.Установить(Абонент);
				Набор.Записать();
			КонецЦикла;
			
			
			НоваяЗапись = РегистрыСведений.бестВыгруженныеЛСГИСЖКХ.СоздатьМенеджерЗаписи();  			
			НоваяЗапись.Период					= Период;
			НоваяЗапись.Организация				= Источник.Организация;
			НоваяЗапись.Район					= Источник.Район;
			НоваяЗапись.Абонент					= Абонент;
			
			НоваяЗапись.ИдентификаторЖКУГИСЖКХ	= ВыборкаИдентификаторов.ИдентификаторЖКУГИСЖКХ;
			НоваяЗапись.ВидПомещения			= Перечисления.бестВидыПомещенийГИСЖКХ.ЖилоеПомещение;
			НоваяЗапись.ФИАС					= ВыборкаИдентификаторов.ИдентификаторДомаФИАС;			
			НоваяЗапись.НомерПомещения			= НомерПомещения;
			НоваяЗапись.АдресОЖФ				= АдресОЖФ;
			НоваяЗапись.Статус					= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;				
			
			НоваяЗапись.Записать();
		КонецЕсли;		
		#КонецОбласти
		
		#Область ВыгрузкаМКД
		Если СтруктураИсточника.ЭтоОткрытиеЛС Или СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
			
			Если ЗначениеЗаполнено(МКД) И МКД.ТипСтроения <> Перечисления.энргТипыСтроений.ЖД_БлокЗастройки Тогда // ??? исправить МКД
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	бестВыгруженныеМКДГИСЖКХ.Период КАК Период
				|ИЗ
				|	РегистрСведений.бестВыгруженныеМКДГИСЖКХ КАК бестВыгруженныеМКДГИСЖКХ
				|ГДЕ
				|	бестВыгруженныеМКДГИСЖКХ.Организация = &Организация
				|	И бестВыгруженныеМКДГИСЖКХ.Район = &Район
				|	И бестВыгруженныеМКДГИСЖКХ.МКД = &МКД
				|	И бестВыгруженныеМКДГИСЖКХ.ВидПомещения = ЗНАЧЕНИЕ(Перечисление.бестВидыПомещенийГИСЖКХ.ЖилоеПомещение)
				|	И бестВыгруженныеМКДГИСЖКХ.НомерПомещения = &НомерПомещения
				|	И бестВыгруженныеМКДГИСЖКХ.Статус = ЗНАЧЕНИЕ(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)";
				Запрос.УстановитьПараметр("НомерПомещения", НомерПомещения);
				
				РезультатЗапроса = Запрос.Выполнить().Выбрать();
				Если РезультатЗапроса.Следующий() Тогда
					// очищаем все старые записи этого МКД
					Набор = РегистрыСведений.бестВыгруженныеМКДГИСЖКХ.СоздатьНаборЗаписей();  			
					Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
					Набор.Отбор.Организация.Установить(Источник.Организация);
					Набор.Отбор.Район.Установить(Источник.Район);
					Набор.Отбор.МКД.Установить(МКД);
					Набор.Отбор.ВидПомещения.Установить(Перечисления.бестВидыПомещенийГИСЖКХ.ЖилоеПомещение);
					Набор.Отбор.НомерПомещения.Установить(НомерПомещения);
					//Набор.Очистить();
					Набор.Записать();
				КонецЕсли;
				
				
				НоваяЗапись = РегистрыСведений.бестВыгруженныеМКДГИСЖКХ.СоздатьМенеджерЗаписи();  			
				НоваяЗапись.Период			= Период;
				НоваяЗапись.Организация		= Источник.Организация;
				НоваяЗапись.Район			= Источник.Район;
				НоваяЗапись.МКД				= МКД;
				НоваяЗапись.ВидПомещения	= Перечисления.бестВидыПомещенийГИСЖКХ.ЖилоеПомещение;
				НоваяЗапись.НомерПомещения	= НомерПомещения;
				НоваяЗапись.ФИАС			= Строка(ВыборкаИдентификаторов.ИдентификаторДомаФИАС);
				
				НоваяЗапись.АдресОЖФ		= АдресМКД;
				НоваяЗапись.ОКТМО			= ВыборкаИдентификаторов.ОКТМО;
				НоваяЗапись.Статус			= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;
				НоваяЗапись.Записать();
				
			КонецЕсли;	
		КонецЕсли;
		#КонецОбласти
		
		#Область ВыгрузкаЖД
		Если СтруктураИсточника.ЭтоОткрытиеЛС Или СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
			Если Не ЗначениеЗаполнено(МКД) Тогда
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	бестВыгруженныеЖДГИСЖКХ.Период КАК Период
				|ИЗ
				|	РегистрСведений.бестВыгруженныеЖДГИСЖКХ КАК бестВыгруженныеЖДГИСЖКХ
				|ГДЕ
				|	бестВыгруженныеЖДГИСЖКХ.Абонент = &Абонент
				|	И бестВыгруженныеЖДГИСЖКХ.Статус = ЗНАЧЕНИЕ(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)
				|	И бестВыгруженныеЖДГИСЖКХ.Организация = &Организация
				|	И бестВыгруженныеЖДГИСЖКХ.Район = &Район";
				
				РезультатЗапроса = Запрос.Выполнить().Выбрать();
				Если РезультатЗапроса.Следующий() Тогда
					// очищаем все старые записи этого ЖД
					Набор = РегистрыСведений.бестВыгруженныеЖДГИСЖКХ.СоздатьНаборЗаписей();  			
					Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
					Набор.Отбор.Организация.Установить(Источник.Организация);
					Набор.Отбор.Район.Установить(Источник.Район);
					Набор.Отбор.Абонент.Установить(Абонент);
					//Набор.Очистить();
					Набор.Записать();
				КонецЕсли;
				
				
				НоваяЗапись = РегистрыСведений.бестВыгруженныеЖДГИСЖКХ.СоздатьМенеджерЗаписи();  			
				НоваяЗапись.Период			= Период;
				НоваяЗапись.Организация		= Источник.Организация;
				НоваяЗапись.Район			= Источник.Район;
				НоваяЗапись.Абонент			= Абонент;
				НоваяЗапись.ФИАС			= ВыборкаИдентификаторов.ИдентификаторДомаФИАС;
				
				НоваяЗапись.АдресОЖФ		= АдресОЖФ;
				НоваяЗапись.ОКТМО			= ВыборкаИдентификаторов.ОКТМО;
				НоваяЗапись.Статус			= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;
				НоваяЗапись.Записать();
				
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти
		
		#Область ВыгрузкаПУ
		Если СтруктураИсточника.ЭтоОткрытиеЛС Или СтруктураИсточника.ЭтоПодключениеУслуги Или СтруктураИсточника.ЭтоВводПУ 
			Или СтруктураИсточника.ЭтоЗаменаПУ Или СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестВыгруженныеПУВГИСЖКХ.Период КАК Период
			|ИЗ
			|	РегистрСведений.бестВыгруженныеПУВГИСЖКХ КАК бестВыгруженныеПУВГИСЖКХ
			|ГДЕ
			|	бестВыгруженныеПУВГИСЖКХ.АбонентМКД = &Абонент
			|	И бестВыгруженныеПУВГИСЖКХ.Статус = ЗНАЧЕНИЕ(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)
			|	И бестВыгруженныеПУВГИСЖКХ.Организация = &Организация
			|	И бестВыгруженныеПУВГИСЖКХ.Район = &Район
			|	И бестВыгруженныеПУВГИСЖКХ.ВидПУ В (ЗНАЧЕНИЕ(Перечисление.бестВидыПриборовУчетаГИСЖКХ.ОбщийКвартирный), ЗНАЧЕНИЕ(Перечисление.бестВидыПриборовУчетаГИСЖКХ.Индивидуальный))";
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Если РезультатЗапроса.Следующий() Тогда
				// очищаем все старые записи этого Абонента
				Набор = РегистрыСведений.бестВыгруженныеПУВГИСЖКХ.СоздатьНаборЗаписей();  			
				Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
				Набор.Отбор.Организация.Установить(Источник.Организация);
				Набор.Отбор.Район.Установить(Источник.Район);
				Набор.Отбор.АбонентМКД.Установить(Абонент);
				//Набор.Очистить();
				Набор.Записать();
			КонецЕсли;
			
			ТекстЗапроса = "";
			Если СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|	энргВводНачальныхОстатковАбоненты.IDСтроки КАК IDСтроки
				|ПОМЕСТИТЬ ВТ_IDСтроки
				|ИЗ
				|	Документ.энргВводНачальныхОстатков.Абоненты КАК энргВводНачальныхОстатковАбоненты
				|ГДЕ
				|	энргВводНачальныхОстатковАбоненты.Абонент = &Абонент
				|	И энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка;";
			КонецЕсли;
			Запрос.Текст = ТекстЗапроса + " " +  
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
			|	ВложенныйЗапрос.Шкала КАК Шкала,
			|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
			|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
			|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВложенныйЗапрос.Услуга) КАК Услуга,
			|	ВЫБОР
			|		КОГДА энргВидыУслугСоставляющиеУслуг.Услуга ЕСТЬ NULL
			|			ТОГДА ВложенныйЗапрос.Услуга.бестКоммунальныйРесурсЖКХ
			|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга.бестКоммунальныйРесурсЖКХ
			|	КОНЕЦ КАК КоммунальныйРесурс,
			|	энргИдентификаторыПУГИСЖКХ.НомерПрибораГИСЖКХ КАК НомерПрибораГИСЖКХ,
			|	ВложенныйЗапрос.ВидПУ КАК ВидПУ
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
			|		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
			|		ТаблицаШкал.Шкала КАК Шкала,
			|		ТаблицаШкал.IDСтроки КАК IDСтроки,
			|		ТаблицаПриборовУчета.Услуга КАК Услуга,
			|		ВЫБОР
			|			КОГДА ВЫРАЗИТЬ(&Абонент КАК Справочник.энргАбоненты).Домовладение
			|				ТОГДА ЗНАЧЕНИЕ(Перечисление.бестВидыПриборовУчетаГИСЖКХ.Индивидуальный)
			|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.бестВидыПриборовУчетаГИСЖКХ.ОбщийКвартирный)
			|		КОНЕЦ КАК ВидПУ
			|	ИЗ
			|		Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТаблицаПриборовУчета
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ШкалыПриборовУчета КАК ТаблицаШкал
			|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
			|				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
			|				И (ТаблицаПриборовУчета.Ссылка = &Ссылка)
			|				И (ТаблицаШкал.Ссылка = &Ссылка)
			|				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
			|				И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК ТаблицаДокумента
			|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
			|				И (ТаблицаПриборовУчета.Ссылка = &Ссылка)
			|				И (ТаблицаДокумента.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
			|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
			|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
			|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
			|		ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
			|			И (ВложенныйЗапрос.Услуга.СоставнаяУслуга)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргИдентификаторыПУГИСЖКХ КАК энргИдентификаторыПУГИСЖКХ
			|		ПО ВложенныйЗапрос.ПриборУчета = энргИдентификаторыПУГИСЖКХ.ПриборУчета
			|
			|УПОРЯДОЧИТЬ ПО
			|	Шкала,
			|	ТарифнаяЗона
			|ИТОГИ ПО
			|	ПриборУчета";
			Если СтруктураИсточника.ЭтоПодключениеУслуги Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргОперацияСЛицевымСчетом", "энргОперацияСУслугами");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоВводПУ Или СтруктураИсточника.ЭтоЗаменаПУ Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргОперацияСЛицевымСчетом", "энргОперацияСПриборомУчета");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоОткрытиеЛС Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");	
			ИначеЕсли СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргОперацияСЛицевымСчетом", "энргВводНачальныхОстатков");
			КонецЕсли;
			
			ВыборкаПУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПУ.Следующий() Цикл
				ВыборкаУслуг = ВыборкаПУ.Выбрать();
				Пока ВыборкаУслуг.Следующий() Цикл
					НоваяЗапись = РегистрыСведений.бестВыгруженныеПУВГИСЖКХ.СоздатьМенеджерЗаписи();  			
					НоваяЗапись.Период							= Период;
					НоваяЗапись.Организация						= Источник.Организация;
					НоваяЗапись.Район							= Источник.Район;
					НоваяЗапись.АбонентМКД						= Абонент;
					НоваяЗапись.ПриборУчета						= ВыборкаУслуг.ПриборУчета;
					НоваяЗапись.КоммунальныйРесурс				= ВыборкаУслуг.КоммунальныйРесурс;
					НоваяЗапись.ВидПУ							= ВыборкаУслуг.ВидПУ;
					//ваяЗапись.НомерПУВГИСЖКХ					= ВыборкаУслуг.НомерПУВГИСЖКХ;
					
					НоваяЗапись.АдресОЖФ						= АдресМКД;
					НоваяЗапись.Показание						= ВыборкаУслуг.Показание;
					НоваяЗапись.Статус							= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;
					НоваяЗапись.Записать();
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		#КонецОбласти  
		
		#Область ЗакрытыеЛС
		Если СтруктураИсточника.ЭтоЗакрытиеЛС Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестВыгруженныеЗакрытыеЛСГИСЖКХ.Период КАК Период
			|ИЗ
			|	РегистрСведений.бестВыгруженныеЗакрытыеЛСГИСЖКХ КАК бестВыгруженныеЗакрытыеЛСГИСЖКХ
			|ГДЕ
			|	бестВыгруженныеЗакрытыеЛСГИСЖКХ.Абонент = &Абонент
			|	И бестВыгруженныеЗакрытыеЛСГИСЖКХ.Статус = Значение(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)";
			
			Запрос.УстановитьПараметр("Абонент", Абонент);
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Если РезультатЗапроса.Следующий() Тогда
				// очищаем все старые записи этого ЖД
				Набор = РегистрыСведений.бестВыгруженныеЗакрытыеЛСГИСЖКХ.СоздатьНаборЗаписей();  			
				Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
				Набор.Отбор.Организация.Установить(Источник.Организация);
				Набор.Отбор.Район.Установить(Источник.Район);
				Набор.Отбор.Абонент.Установить(Абонент);
				//Набор.Очистить();
				Набор.Записать();
			КонецЕсли;
			
			
			НоваяЗапись = РегистрыСведений.бестВыгруженныеЗакрытыеЛСГИСЖКХ.СоздатьМенеджерЗаписи();  			
			НоваяЗапись.Период			= Период;
			НоваяЗапись.Организация		= Источник.Организация;
			НоваяЗапись.Район			= Источник.Район;
			НоваяЗапись.Абонент			= Абонент;
			
			НоваяЗапись.АдресОЖФ		= АдресОЖФ;
			НоваяЗапись.ДатаЗакрытия	= Источник.Дата;
			НоваяЗапись.ПричинаЗакрытия	= Источник.бестПричинаЗакрытияЛС;
			НоваяЗапись.Примечание		= Источник.Примечание;
			НоваяЗапись.Статус			= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;
			НоваяЗапись.Записать();		
		КонецЕсли;
		#КонецОбласти
		
		#Область ВыгрузкаПоказанийПУ
		Если СтруктураИсточника.ЭтоРегистрацияПоказанийАбонента Или СтруктураИсточника.ЭтоКвитанция Или СтруктураИсточника.ЭтоРегистрацияПоказанийМКД
			Или СтруктураИсточника.ЭтоЗакрытиеМКД Или СтруктураИсточника.ЭтоОтключениеУслуги Или СтруктураИсточника.ЭтоЗакрытиеЛС
			Или СтруктураИсточника.ЭтоВыводПУ Или СтруктураИсточника.ЭтоЗаменаПУ Или СтруктураИсточника.ЭтоОбходнойЛист Или СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда		
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестВыгруженныеПоказанияПУВГИСЖКХ.Период КАК Период,
			|	бестВыгруженныеПоказанияПУВГИСЖКХ.ПриборУчета КАК ПриборУчета
			|ИЗ
			|	РегистрСведений.бестВыгруженныеПоказанияПУВГИСЖКХ КАК бестВыгруженныеПоказанияПУВГИСЖКХ
			|ГДЕ
			|	бестВыгруженныеПоказанияПУВГИСЖКХ.ПриборУчета в (&Приборы)
			|	И бестВыгруженныеПоказанияПУВГИСЖКХ.Статус = ЗНАЧЕНИЕ(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)
			|	И бестВыгруженныеПоказанияПУВГИСЖКХ.Организация = &Организация
			|	И бестВыгруженныеПоказанияПУВГИСЖКХ.Район = &Район";
			Запрос.УстановитьПараметр("Приборы",		Источник.ТочкиУчета.ВыгрузитьКолонку("ПриборУчета"));
			Запрос.УстановитьПараметр("Район",			Источник.Район);
			Запрос.УстановитьПараметр("Организация",	Источник.Организация);
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Если РезультатЗапроса.Следующий() Тогда
				// очищаем все старые записи этого ПУ
				Набор = РегистрыСведений.бестВыгруженныеПоказанияПУВГИСЖКХ.СоздатьНаборЗаписей();  			
				Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
				Набор.Отбор.Организация.Установить(Источник.Организация);
				Набор.Отбор.Район.Установить(Источник.Район);
				Набор.Отбор.ПриборУчета.Установить(РезультатЗапроса.ПриборУчета);
				//Набор.Очистить();
				Набор.Записать();
			КонецЕсли;
			
			ТекстЗапроса = "";
			Если СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|	энргВводНачальныхОстатковАбоненты.IDСтроки КАК IDСтроки
				|ПОМЕСТИТЬ ВТ_IDСтроки
				|ИЗ
				|	Документ.энргВводНачальныхОстатков.Абоненты КАК энргВводНачальныхОстатковАбоненты
				|ГДЕ
				|	энргВводНачальныхОстатковАбоненты.Абонент = &Абонент
				|	И энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка;";
			КонецЕсли;
			Запрос.Текст = ТекстЗапроса + " " + 
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
			|	ВложенныйЗапрос.Шкала КАК Шкала,
			|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
			|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
			|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВложенныйЗапрос.Услуга) КАК Услуга,
			|	ВЫБОР
			|		КОГДА энргВидыУслугСоставляющиеУслуг.Услуга ЕСТЬ NULL
			|			ТОГДА ВложенныйЗапрос.Услуга.бестКоммунальныйРесурсЖКХ
			|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга.бестКоммунальныйРесурсЖКХ
			|	КОНЕЦ КАК КоммунальныйРесурс,
			|	энргИдентификаторыПУГИСЖКХ.НомерПрибораГИСЖКХ КАК НомерПрибораГИСЖКХ
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
			|		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
			|		ТаблицаШкал.Шкала КАК Шкала,
			|		ТаблицаШкал.IDСтроки КАК IDСтроки,
			|		ТаблицаПриборовУчета.Услуга КАК Услуга
			|	ИЗ
			|		Документ.энргРегистрацияПоказанийАбонента.ТочкиУчета КАК ТаблицаПриборовУчета
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ШкалыПриборовУчета КАК ТаблицаШкал
			|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
			|				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
			|				И (ТаблицаПриборовУчета.Ссылка = &Ссылка)
			|				И (ТаблицаШкал.Ссылка = &Ссылка)
			|				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
			|				И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента КАК ТаблицаДокумента
			|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
			|				И (ТаблицаПриборовУчета.Ссылка = &Ссылка)
			|				И (ТаблицаДокумента.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
			|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
			|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
			|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &Ссылка)
			|			И (ТаблицаПоказанийПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
			|		ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
			|			И (ВложенныйЗапрос.Услуга.СоставнаяУслуга)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргИдентификаторыПУГИСЖКХ КАК энргИдентификаторыПУГИСЖКХ
			|		ПО ВложенныйЗапрос.ПриборУчета = энргИдентификаторыПУГИСЖКХ.ПриборУчета
			|
			|УПОРЯДОЧИТЬ ПО
			|	Шкала,
			|	ТарифнаяЗона
			|ИТОГИ ПО
			|	ПриборУчета";
			
			Если СтруктураИсточника.ЭтоКвитанция Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРегистрацияПоказанийАбонента", "энргПриходныйКассовыйОрдер");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоОбходнойЛист Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРегистрацияПоказанийАбонента", "энргОбходнойЛист");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтроки В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоРегистрацияПоказанийМКД Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРегистрацияПоказанийАбонента", "энргРегистрацияПоказанийМКД");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоОтключениеУслуги Или СтруктураИсточника.ЭтоПодключениеУслуги Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРегистрацияПоказанийАбонента", "энргОперацияСУслугами");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоЗакрытиеЛС Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРегистрацияПоказанийАбонента", "энргОперацияСЛицевымСчетом");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоЗакрытиеМКД Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРегистрацияПоказанийАбонента", "энргОткрытиеМКД");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоВыводПУ Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРегистрацияПоказанийАбонента",	"энргОперацияСПриборомУчета");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаПриборовУчета.ПриборУчета",	"ТаблицаПриборовУчета.ПриборУчетаВывод");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоЗаменаПУ Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРегистрацияПоказанийАбонента",	"энргОперацияСПриборомУчета");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаПриборовУчета.ПриборУчета",	"ТаблицаПриборовУчета.ПриборУчетаВывод");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаПриборовУчета.IDСтроки",		"ТаблицаПриборовУчета.IDСтрокиВывод");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиВыводАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			ИначеЕсли СтруктураИсточника.ЭтоВводНачальныхОстатков Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргРегистрацияПоказанийАбонента", "энргВводНачальныхОстатков");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (ТаблицаПоказанийПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))", "");
			ИначеЕсли СтруктураИсточника.ЭтоРегистрацияПоказанийАбонента Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаПриборовУчета.IDСтрокиАбонента В (ВЫБРАТЬ ВТ.IDСтроки ИЗ ВТ_IDСтроки КАК ВТ)", "");
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
			ВыборкаПУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПУ.Следующий() Цикл
				ВыборкаУслуг = ВыборкаПУ.Выбрать();
				Пока ВыборкаУслуг.Следующий() Цикл
					НоваяЗапись = РегистрыСведений.бестВыгруженныеПоказанияПУВГИСЖКХ.СоздатьМенеджерЗаписи();  			
					НоваяЗапись.Период							= Период;
					НоваяЗапись.Организация						= Источник.Организация;
					НоваяЗапись.Район							= Источник.Район;
					НоваяЗапись.ПриборУчета						= ВыборкаУслуг.ПриборУчета;
					НоваяЗапись.КоммунальныйРесурс				= ВыборкаУслуг.Услуга.бестКоммунальныйРесурсЖКХ;
					НоваяЗапись.ЭтоМКД							= СтруктураИсточника.ЭтоРегистрацияПоказанийМКД;
					
					НоваяЗапись.АдресОЖФ						= АдресОЖФ;
					НоваяЗапись.Показание						= ВыборкаУслуг.Показание;
					НоваяЗапись.ДатаСнятияПоказаний             = Источник.Дата;
					НоваяЗапись.Статус							= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;
					НоваяЗапись.Записать();
				КонецЦикла;
			КонецЦикла;
			
 		КонецЕсли;
		#КонецОбласти 
		
		#Область ВыгрузкаОДПУ
		Если СтруктураИсточника.ЭтоОткрытиеМКД Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестВыгруженныеПУВГИСЖКХ.Период КАК Период
			|ИЗ
			|	РегистрСведений.бестВыгруженныеПУВГИСЖКХ КАК бестВыгруженныеПУВГИСЖКХ
			|ГДЕ
			|	бестВыгруженныеПУВГИСЖКХ.АбонентМКД = &МКД
			|	И бестВыгруженныеПУВГИСЖКХ.Статус = ЗНАЧЕНИЕ(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)
			|	И бестВыгруженныеПУВГИСЖКХ.Организация = &Организация
			|	И бестВыгруженныеПУВГИСЖКХ.Район = &Район
			|	И бестВыгруженныеПУВГИСЖКХ.ВидПУ = ЗНАЧЕНИЕ(Перечисление.бестВидыПриборовУчетаГИСЖКХ.Коллективный)";
			
			Запрос.УстановитьПараметр("Приборы",		Источник.ТочкиУчета.ВыгрузитьКолонку("ПриборУчета"));
			Запрос.УстановитьПараметр("Район",			Источник.Район);
			Запрос.УстановитьПараметр("Организация",	Источник.Организация);
			Запрос.УстановитьПараметр("МКД",			МКД);
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Если РезультатЗапроса.Следующий() Тогда
				// очищаем все старые записи этого ПУ
				Набор = РегистрыСведений.бестВыгруженныеПУВГИСЖКХ.СоздатьНаборЗаписей();  			
				Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
				Набор.Отбор.Организация.Установить(Источник.Организация);
				Набор.Отбор.Район.Установить(Источник.Район);
				Набор.Отбор.АбонентМКД.Установить(МКД);
				//Набор.Очистить();
				Набор.Записать();
			КонецЕсли;
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
			|	ВложенныйЗапрос.Шкала КАК Шкала,
			|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
			|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
			|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВложенныйЗапрос.Услуга) КАК Услуга,
			|	ВЫБОР
			|		КОГДА энргВидыУслугСоставляющиеУслуг.Услуга ЕСТЬ NULL
			|			ТОГДА ВложенныйЗапрос.Услуга.бестКоммунальныйРесурсЖКХ
			|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга.бестКоммунальныйРесурсЖКХ
			|	КОНЕЦ КАК КоммунальныйРесурс,
			|	энргИдентификаторыПУГИСЖКХ.НомерПрибораГИСЖКХ КАК НомерПрибораГИСЖКХ
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
			|		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
			|		ТаблицаШкал.Шкала КАК Шкала,
			|		ТаблицаШкал.IDСтроки КАК IDСтроки,
			|		ТаблицаПриборовУчета.Услуга КАК Услуга
			|	ИЗ
			|		Документ.энргОткрытиеМКД.ТочкиУчета КАК ТаблицаПриборовУчета
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОткрытиеМКД.ШкалыПриборовУчета КАК ТаблицаШкал
			|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
			|				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
			|				И (ТаблицаПриборовУчета.Ссылка = &Ссылка)
			|				И (ТаблицаШкал.Ссылка = &Ссылка)
			|				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОткрытиеМКД КАК ТаблицаДокумента
			|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
			|				И (ТаблицаПриборовУчета.Ссылка = &Ссылка)
			|				И (ТаблицаДокумента.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОткрытиеМКД.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
			|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
			|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
			|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
			|		ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
			|			И (ВложенныйЗапрос.Услуга.СоставнаяУслуга)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргИдентификаторыПУГИСЖКХ КАК энргИдентификаторыПУГИСЖКХ
			|		ПО ВложенныйЗапрос.ПриборУчета = энргИдентификаторыПУГИСЖКХ.ПриборУчета
			|
			|УПОРЯДОЧИТЬ ПО
			|	Шкала,
			|	ТарифнаяЗона
			|ИТОГИ ПО
			|	ПриборУчета";
			Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
			ВыборкаПУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПУ.Следующий() Цикл
				ВыборкаУслуг = ВыборкаПУ.Выбрать();
				Пока ВыборкаУслуг.Следующий() Цикл
					НоваяЗапись = РегистрыСведений.бестВыгруженныеПУВГИСЖКХ.СоздатьМенеджерЗаписи();  			
					НоваяЗапись.Период							= Период;
					НоваяЗапись.Организация						= Источник.Организация;
					НоваяЗапись.Район							= Источник.Район;
					НоваяЗапись.АбонентМКД						= МКД;
					НоваяЗапись.ПриборУчета						= ВыборкаУслуг.ПриборУчета;
					НоваяЗапись.КоммунальныйРесурс				= ВыборкаУслуг.КоммунальныйРесурс;
					НоваяЗапись.ВидПУ							= Перечисления.бестВидыПриборовУчетаГИСЖКХ.Коллективный;
					//ваяЗапись.НомерПУВГИСЖКХ					= ВыборкаУслуг.НомерПУВГИСЖКХ;
					
					НоваяЗапись.АдресОЖФ						= АдресОЖФ;
					НоваяЗапись.Показание						= ВыборкаУслуг.Показание;
					НоваяЗапись.Статус							= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;
					НоваяЗапись.Записать();
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		#КонецОбласти 
		
		#Область ВыгрузкаЛС
		Если СтруктураИсточника.ЭтоОплата Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестВыгруженныеЛСГИСЖКХ.Период КАК Период
			|ИЗ
			|	РегистрСведений.бестВыгруженныеЛСГИСЖКХ КАК бестВыгруженныеЛСГИСЖКХ
			|ГДЕ
			|	бестВыгруженныеЛСГИСЖКХ.Абонент = &Абонент
			|	И бестВыгруженныеЛСГИСЖКХ.Статус = ЗНАЧЕНИЕ(Перечисление.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись)
			|	И бестВыгруженныеЛСГИСЖКХ.Организация = &Организация
			|	И бестВыгруженныеЛСГИСЖКХ.Район = &Район";
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Пока РезультатЗапроса.Следующий() Цикл
				// очищаем все старые записи этого ЛС
				Набор = РегистрыСведений.бестВыгруженныеЛСГИСЖКХ.СоздатьНаборЗаписей();  			
				Набор.Отбор.Период.Установить(РезультатЗапроса.Период);
				Набор.Отбор.Организация.Установить(Источник.Организация);
				Набор.Отбор.Район.Установить(Источник.Район);
				Набор.Отбор.Абонент.Установить(Абонент);
				Набор.Записать();
			КонецЦикла;
			
			
			НоваяЗапись = РегистрыСведений.бестВыгруженныеЛСГИСЖКХ.СоздатьМенеджерЗаписи();  			
			НоваяЗапись.Период					= Период;
			НоваяЗапись.Организация				= Источник.Организация;
			НоваяЗапись.Район					= Источник.Район;
			НоваяЗапись.Абонент					= Абонент;
			
			НоваяЗапись.ИдентификаторЖКУГИСЖКХ	= ВыборкаИдентификаторов.ИдентификаторЖКУГИСЖКХ;
			НоваяЗапись.ВидПомещения			= Перечисления.бестВидыПомещенийГИСЖКХ.ЖилоеПомещение;
			НоваяЗапись.ФИАС					= ВыборкаИдентификаторов.ИдентификаторДомаФИАС;			
			НоваяЗапись.НомерПомещения			= НомерПомещения;
			НоваяЗапись.АдресОЖФ				= АдресОЖФ;
			НоваяЗапись.Статус					= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;				
			
			НоваяЗапись.Записать();
		КонецЕсли;		
		#КонецОбласти	
		
		#Область Оплата
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Источник",		Источник.Ссылка);
		Запрос.УстановитьПараметр("Организация",	Источник.Организация);
		Запрос.УстановитьПараметр("Район",			Источник.Район);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПлатежноеПоручениеВходящиеОплата.Абонент КАК Абонент,
		|	энргПлатежноеПоручениеВходящиеОплата.Услуга КАК Услуга,
		|	СУММА(энргПлатежноеПоручениеВходящиеОплата.СуммаОплаты) КАК СуммаПлатежа,
		|	энргПлатежноеПоручениеВходящиеОплата.НазначениеПлатежа КАК НазначениеПлатежа,
		|	энргПлатежноеПоручениеВходящиеОплата.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
		|	энргПлатежноеПоручениеВходящиеОплата.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
		|	&Организация КАК Организация,
		|	энргИдентификаторыАбонентаГИСЖКХ.ИдентификаторЖКУГИСЖКХ КАК ИдентификаторЖКУГИСЖКХ,
		|	энргПлатежноеПоручениеВходящиеОплата.Абонент.Район КАК Район
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргИдентификаторыАбонентаГИСЖКХ КАК энргИдентификаторыАбонентаГИСЖКХ
		|		ПО энргПлатежноеПоручениеВходящиеОплата.Абонент = энргИдентификаторыАбонентаГИСЖКХ.Абонент
		|ГДЕ
		|	энргПлатежноеПоручениеВходящиеОплата.Ссылка = &Источник
		|
		|СГРУППИРОВАТЬ ПО
		|	энргПлатежноеПоручениеВходящиеОплата.Абонент,
		|	энргПлатежноеПоручениеВходящиеОплата.Услуга,
		|	энргПлатежноеПоручениеВходящиеОплата.НомерПлатежногоДокумента,
		|	энргПлатежноеПоручениеВходящиеОплата.ДатаПлатежногоДокумента,
		|	энргПлатежноеПоручениеВходящиеОплата.НазначениеПлатежа,
		|	энргИдентификаторыАбонентаГИСЖКХ.ИдентификаторЖКУГИСЖКХ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			// очищаем все старые записи этого ЛС
			Набор = РегистрыСведений.бестИсторияОплатыГИСЖКХ.СоздатьНаборЗаписей();  			
			Набор.Отбор.Организация.Установить(Источник.Организация);
			Набор.Отбор.Район.Установить(Выборка.Район);
			Набор.Отбор.Абонент.Установить(Выборка.Абонент);
			Набор.Отбор.ДатаПлатежногоДокумента.Установить(Выборка.ДатаПлатежногоДокумента);
			Набор.Отбор.НомерПлатежногоДокумента.Установить(Выборка.НомерПлатежногоДокумента);
			
			НоваяЗапись = Набор.Добавить();  			
			НоваяЗапись.Организация				= Источник.Организация;
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Статус					= Перечисления.бестСтатусыРаботыСГИСЖКХ.НоваяЗапись;				
			
			Набор.Записать();					
		КонецЦикла;
		
	КонецЕсли;	
	#КонецОбласти	
	
КонецПроцедуры

#КонецОбласти




#КонецОбласти
